## revision notebook for numpy and pandas

### inthis notebook i am covering all function and method of numpy with pandas

In [1]:
import numpy as np
import pandas as pd
import numpy.random as npr

In [2]:
arr = np.array([[i for i in range(1,21)] for j in range(1,21)])

In [14]:
print(f"shape of my arr{arr.shape} size of my arr {arr.size} ,dtype of my arr {arr.dtype}  ,item size of my arr {arr.itemsize} ,dimension of my arr {arr.ndim} ")

shape of my arr(20, 20) size of my arr 400 ,dtype of my arr int32  ,item size of my arr 4 ,dimension of my arr 2

In [22]:
it = 'hello world'
ar=np.frombuffer(it,count=-1,offset=0)
#it dosent work i don,t know about this

TypeError: a bytes-like object is required, not 'str'

In [24]:
tr=list(range(1,11))
tre=iter(tr)
tre
# and now this is iterator 
# we are using formiter function of numpy

In [35]:

np.fromiter(tre,dtype='int',count=-1)

array([], dtype=int32)

In [36]:
np.asarray(tr,dtype='float')
# use for creating ndarray similar to array function of array

array([ 1.,  2.,  3.,  4.,  5.,  6.,  7.,  8.,  9., 10.])

In [13]:
arr[19,19]=400

In [14]:
arr

array([[  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19, 400]])

In [17]:
arr[19,18]=300

In [18]:
arr

array([[  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20],
       [  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18, 300, 400]])

In [19]:
import os

In [20]:
os.getcwd()

'C:\\Users\\Dell\\Desktop'

# arange function create single dimension 
# by using arange function

In [41]:
ar = np.arange(2,5,dtype='float').reshape(3,1)
ar

array([[2.],
       [3.],
       [4.]])

In [42]:
ar.ndim

2

# reshape function for single dimension to multidimension

In [6]:
ar.reshape(1,3)

array([[2, 3, 4]])

In [7]:
ar.ndim

1

# zeros function create a array in range with zero filling

In [44]:
rt = np.zeros((2,5))

In [11]:
rt

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

# ravel function using convert single dimension

In [45]:
pr = np.ravel(rt,order="k")
pr

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

# linspace for creating similar difference array in range like 1 to 5 and 10 element

In [64]:
tt = np.linspace(1,10,8,dtype='f')
tt

array([ 1.       ,  2.2857144,  3.5714285,  4.857143 ,  6.142857 ,
        7.428571 ,  8.714286 , 10.       ], dtype=float32)

In [54]:
tt.size

8

In [17]:
tt.shape

(8,)

In [19]:
tt.ndim

1

In [66]:
tt.nbytes

32

In [65]:
tt.dtype

dtype('float32')

# empty function create npy array with filling random number

In [68]:
tr = np.empty((3,5))
tr

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [69]:
tre = np.empty((5,5),np.int64)

In [73]:
tre

array([[      2007862452376,                 150,                   0,
                          0,   32651513910263808],
       [4189017755886035579, 8083807916600337019, 6999220690442871148,
        3484478966094459506, 3467820289962814510],
       [3467820289962814510, 2314885866833337646, 3183535154536652832,
        3183534901335830560, 6714357009194299424],
       [2314885530823580716, 3467820289966678048, 3467820289962814510,
        2980640981346429998, 7022349238376627490],
       [9041884596214718820, 8391722768137527852, 7959390389040738153,
          31662877773013620,        450971566201]], dtype=int64)

In [26]:
tre.ndim

2

In [27]:
tre.nbytes

200

In [28]:
tre.shape

(5, 5)

In [29]:
tre.dtype

dtype('int64')

# Empty_like function create array similar type
# another array

In [3]:
w = np.linspace(2,10,5)
w
#here ending point are inclusive

array([ 2.,  4.,  6.,  8., 10.])

In [4]:
we = np.empty_like(w)
we
# this function return same return dtype and same shape of existing array

array([ 2.,  4.,  6.,  8., 10.])

In [5]:
we = np.empty_like(w)
we

array([ 2.,  4.,  6.,  8., 10.])

# identity fuction 
# create npy array same row size and column
# with filling randomly input number

In [6]:
f = np.identity(10)

In [7]:
f

array([[1., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 1.]])

In [8]:
f.shape

(10, 10)

In [10]:
f.size

100

In [74]:
fr = np.array([[i for i in range(1,4)] for j in range(1,4)])
fr

array([[1, 2, 3],
       [1, 2, 3],
       [1, 2, 3]])

# fr.sum()     # add for all element
# and now sum by using axis value

In [75]:
fr.sum(axis = 1)

array([6, 6, 6])

In [76]:
fr.sum(axis = 0)

array([3, 6, 9])

In [77]:
fr.sum()

18

In [78]:
np.sum(fr)

18

In [81]:
fr.argmax(axis=1)

array([2, 2, 2], dtype=int64)

In [82]:
fr.argmin(axis=0)

array([0, 0, 0], dtype=int64)

# transpose convert row into column

In [16]:
fr

array([[1, 2, 3],
       [1, 2, 3],
       [1, 2, 3]])

In [18]:
fr.T

array([[1, 1, 1],
       [2, 2, 2],
       [3, 3, 3]])

In [20]:
fr.T

array([[1, 1, 1],
       [2, 2, 2],
       [3, 3, 3]])

In [3]:
import os

In [7]:
os.getcwd()

'C:\\Users\\Dell\\Desktop'

In [8]:
os.listdir()

['.ipynb_checkpoints',
 'Bubbles - Shortcut.lnk',
 'chachal.jpeg',
 'dwld',
 'h2.jpg',
 'IMG_20200326_210100.jpg',
 'index.html',
 'laptop.jpg',
 'laptop2.jpg',
 'laptop3.jpg',
 'LINKS - Mark II.appref-ms',
 'Microsoft Edge.lnk',
 'notepad.lnk',
 'pdf',
 'project',
 'python syllabus.docx',
 'raj.jpg',
 'raj1.jpg',
 'ranj.jpg',
 'revision notebook for numpy array.ipynb',
 'sachin.txt',
 'SlideToShutDown.lnk',
 'style.css',
 'sublime_text - Shortcut.lnk',
 'typing chart.jpg',
 'unit_1.pdf',
 'Visual Studio Code - Insiders.lnk',
 'vs_ code shortcuts.pdf',
 'whtspdf',
 'Zoom.lnk']

In [12]:
with open("file.txt","w") as file:
    s="this is my file"
    b=file.write(s)

In [15]:
with open("file.txt","r") as file_readr:
    read_file=file_readr.read()
    print(read_file)

this is my file

In [16]:
import shutil

In [17]:
os.getcwd()

'C:\\Users\\Dell\\Desktop'

In [18]:
shutil.move("C:\\Users\\Dell\\Desktop\\file.txt",'C:\\Users\\Dell\\Desktop\\dwld\\ranjitfile.txt')

'C:\\Users\\Dell\\Desktop\\dwld\\ranjitfile.txt'

In [19]:
os.listdir()

['.ipynb_checkpoints',
 'Bubbles - Shortcut.lnk',
 'chachal.jpeg',
 'dwld',
 'h2.jpg',
 'IMG_20200326_210100.jpg',
 'index.html',
 'laptop.jpg',
 'laptop2.jpg',
 'laptop3.jpg',
 'LINKS - Mark II.appref-ms',
 'Microsoft Edge.lnk',
 'notepad.lnk',
 'pdf',
 'project',
 'python syllabus.docx',
 'raj.jpg',
 'raj1.jpg',
 'ranj.jpg',
 'revision notebook for numpy array.ipynb',
 'sachin.txt',
 'SlideToShutDown.lnk',
 'style.css',
 'sublime_text - Shortcut.lnk',
 'typing chart.jpg',
 'unit_1.pdf',
 'Visual Studio Code - Insiders.lnk',
 'vs_ code shortcuts.pdf',
 'whtspdf',
 'Zoom.lnk']

In [39]:
os.chdir('C:\\Users\\Dell\\Desktop\\dwld')

In [40]:
walkk=os.walk(r".")

In [44]:
for i in walkk:
    print("this is my data",i)

In [38]:
d = os.listdir('C:\\Users\\Dell\\Desktop\\dwld')

In [36]:
ls

[]

In [23]:
type(d)
len(d)
for i in d:
    print()
    print(i)

3_Big_Mistakes_in_Your_English_Listening__Go_Natural_English(480p).mp4

500+_Daily_Use_English_Sentences_।_English_Speaking_Practice(128k).m4a

50_English_Phrases_to_Use_in_a_Conversation(480p).mp4

52_GAJ_KA_DAMAN__PRANJAL_DAHIYA__AMAN_JAJI__RENUKA_PANWAR__MUKESH_JAJI__SAHIL_SANDHU(256k).mp3

Active_and_Passive_Voice__RULES,_TRICKS,_CHARTS,_EXERCISES,_EXAMPLES_&_PDF__English_Grammar(480p).mp4

Active_Passive_Voice_of_Modals_Helping_Verbs(360p).mp4

Active_Passive_Voice_of_Modals_Helping_Verbs(360p).mp4.smi

Automatic_English_Conversation(720p).mp4

Bhut_Gana_Pyar_Hai_Tere_T_!!_By_Chetna_New_Video_!!_Viki_Entertainment(240p).mp4

Coding_Deletion_Operation_in_Array_Using_C_Language_(With_Notes)(720p).mp4

Coding_Insertion_Operation_in_Array_in_Data_Structures_in_C_language(720p).mp4

constraints_in_dbms__key,_domain_&_referential_integrity_(360p).mp4

data_independence_in_dbms__logical_and_physical_data_(360p).mp4

Excuse_Me__Kaka__New_Song_Latest_punjabi_Songs_2020_Libaas(360p).mp4

Functional_dependency_in_DBMS__What_is_functional_dependency__Database_Management_System(360p).mp4

Haryanvi_Beat_-_Diler_Kharkiya__Renuka_Panwar__Angel_Rai__New_Haryanvi_Song_Haryanavi_2021(1080p).mp4

Keh_Len_De_(Official_Video)_Kaka__Latest_Punjabi_Song_2021__New_Punjabi_Songs_2021__Haani_Records(1080p).mp4

Keh_Len_De_(Official_Video)_Kaka__Latest_Punjabi_Song_2021__New_Punjabi_Songs_2021__Haani_Records(1080p).mp4.smi

Ke_Baar_Baar_Samjhana_(के_बार_बार_समझाना)_Full_Song_with_Lyrics__Best_WhatsApp_Status__Dhull_HR(360p).mp4

Learn_English_in_30_Minutes_-_ALL_the_English_Basics_You_Need(240p).mp4

Learn_English_through_Hindi__1000_sentences_for_English_speaking_आसान_अगंर्जेी__Full_course(480p).mp4

Maa_Ki_Mamta__Adarsh_Sharma__Haryanvi_Ragni_Song_2020__Sonotek_Haryanvi(480p).mp4

Mehendi_Wale_Haath_Song_Guru_Randhawa_Sanjana_SSayeed_Q,_Sachet-Parampara,_Arvindr_Bhushan_Kumar(256k).mp3

Milne_Hai_Mujhse_Aayi__cover_@Sakshi_Singh__Sing_Dil_Se__Aashiqui_2__Arijit_Singh(256k).mp3

My_top_25_pandas_tricks(720p).mp4.smi

o_pata_nahi_ji_konsa_nasha_karta_hai_-_Titliyan_full_Song_Hardy_Sandhu__Yaar_Mera_Titliyan_Warga(256k).mp3

Passive_voice_of_LET__Active_and_Passive_Voice_in_English_Grammar(480p).mp4

Salam-E-Ishq_Meri_Jaan_Zara_Kabul_Kar_Lo__Muqaddar_Ka_Sikandar (1978)__Amitabh_Bachchan,_Rekha(1080p).mp4

SEARCHING_&_SORTING_COMPLETE_(_In_just_50_min)(360p).mp4

Second_Normal_Form_in_DBMS__2NF_in_dbms__Normalization_in_DBMS(360p).mp4

Second_Normal_Form_in_DBMS__2NF_in_dbms__Normalization_in_DBMS(360p).mp4.smi

Tu_Chahida_Song,_Ve_Mainu_Juttiyan_Di_Lod_Nahi_Tu_Chahida,_Ve_Mainu_Tu_Chahida_Riyaz_Aly,_Aroob_Khan(720p).mp4

Understand_FAST_English_Conversations(480p).mp4

Understand_FAST_English_Conversations(480p).mp4.smi

vm3u8cache

WRITING_SKILL,Essay_Writing_(The_Most_important)कैसे_सोचे_कैसे_लिखे_🔥🔥(480p).mp4

Yaaro_Tod_Deni_Surjit_Bhullar__यारी_तोड़_दनेी__Surjit_Bhullar__Panjabi_Song__2020(256k).mp3

_Fazilpuria_feat_Deepti__Afsana__Jaani__SukhE__New_Haryanvi_Songs_Haryanavi_2020(256k).mp3

_First_Normal_form_in_DBMS_in_HINDI__1st_Normal_form_कय्ा_होती_ह_ै(360p).mp4

_Jass_Manak_(Full_Video)_Satti_Dhillon__Sharry_Nexus__GK_DIGITAL__New_Songs__Geet_MP3(256k).mp3

_Neha_Kakkar,_Sunny_Kaushal__Jubin_Nautiyal,Jaani__Bhushan_Kumar__Arvindr_K(256k).mp3

_Third_Normal_Form_in_dbms_with_examples_in_Hindi__Normalization(360p).mp4

_Tum_Hi_Aana__Marjaavaan__Riteish_D,_Sidharth_M,_Tara_S_Jubin_Nautiyal,Payal_Dev,Kunaal_V(256k).mp3

मैया_तेरे_चरणों_की_Ambe_Tere_Charno_Ki__बहुत_ही_मधुर_नये_म्यूजिक_के_साथ___Saijal__Isha__Anchal(256k).mp3

In [26]:
d[1:10]

['500+_Daily_Use_English_Sentences_।_English_Speaking_Practice(128k).m4a',
 '50_English_Phrases_to_Use_in_a_Conversation(480p).mp4',
 '52_GAJ_KA_DAMAN__PRANJAL_DAHIYA__AMAN_JAJI__RENUKA_PANWAR__MUKESH_JAJI__SAHIL_SANDHU(256k).mp3',
 'Active_and_Passive_Voice__RULES,_TRICKS,_CHARTS,_EXERCISES,_EXAMPLES_&_PDF__English_Grammar(480p).mp4',
 'Active_Passive_Voice_of_Modals_Helping_Verbs(360p).mp4',
 'Active_Passive_Voice_of_Modals_Helping_Verbs(360p).mp4.smi',
 'Automatic_English_Conversation(720p).mp4',
 'Bhut_Gana_Pyar_Hai_Tere_T_!!_By_Chetna_New_Video_!!_Viki_Entertainment(240p).mp4',
 'Coding_Deletion_Operation_in_Array_Using_C_Language_(With_Notes)(720p).mp4']

In [24]:
os.getcwd()

'C:\\Users\\Dell\\Desktop\\dwld'

In [25]:
os.remove("ranjitfile.txt")

In [26]:
os.getcwd()

'C:\\Users\\Dell\\Desktop\\dwld'

In [27]:
for i in os.listdir():
    print(i)

3_Big_Mistakes_in_Your_English_Listening__Go_Natural_English(480p).mp4
500+_Daily_Use_English_Sentences_।_English_Speaking_Practice(128k).m4a
50_English_Phrases_to_Use_in_a_Conversation(480p).mp4
52_GAJ_KA_DAMAN__PRANJAL_DAHIYA__AMAN_JAJI__RENUKA_PANWAR__MUKESH_JAJI__SAHIL_SANDHU(256k).mp3
Active_and_Passive_Voice__RULES,_TRICKS,_CHARTS,_EXERCISES,_EXAMPLES_&_PDF__English_Grammar(480p).mp4
Active_Passive_Voice_of_Modals_Helping_Verbs(360p).mp4
Active_Passive_Voice_of_Modals_Helping_Verbs(360p).mp4.smi
Automatic_English_Conversation(720p).mp4
Bhut_Gana_Pyar_Hai_Tere_T_!!_By_Chetna_New_Video_!!_Viki_Entertainment(240p).mp4
Coding_Deletion_Operation_in_Array_Using_C_Language_(With_Notes)(720p).mp4
Coding_Insertion_Operation_in_Array_in_Data_Structures_in_C_language(720p).mp4
constraints_in_dbms__key,_domain_&_referential_integrity_(360p).mp4
data_independence_in_dbms__logical_and_physical_data_(360p).mp4
Excuse_Me__Kaka__New_Song_Latest_punjabi_Songs_2020_Libaas(360p).mp4
Functional_dependency_in_DBMS__What_is_functional_dependency__Database_Management_System(360p).mp4
Haryanvi_Beat_-_Diler_Kharkiya__Renuka_Panwar__Angel_Rai__New_Haryanvi_Song_Haryanavi_2021(1080p).mp4
Keh_Len_De_(Official_Video)_Kaka__Latest_Punjabi_Song_2021__New_Punjabi_Songs_2021__Haani_Records(1080p).mp4
Keh_Len_De_(Official_Video)_Kaka__Latest_Punjabi_Song_2021__New_Punjabi_Songs_2021__Haani_Records(1080p).mp4.smi
Ke_Baar_Baar_Samjhana_(के_बार_बार_समझाना)_Full_Song_with_Lyrics__Best_WhatsApp_Status__Dhull_HR(360p).mp4
Learn_English_in_30_Minutes_-_ALL_the_English_Basics_You_Need(240p).mp4
Learn_English_through_Hindi__1000_sentences_for_English_speaking_आसान_अगंर्जेी__Full_course(480p).mp4
Maa_Ki_Mamta__Adarsh_Sharma__Haryanvi_Ragni_Song_2020__Sonotek_Haryanvi(480p).mp4
Mehendi_Wale_Haath_Song_Guru_Randhawa_Sanjana_SSayeed_Q,_Sachet-Parampara,_Arvindr_Bhushan_Kumar(256k).mp3
Milne_Hai_Mujhse_Aayi__cover_@Sakshi_Singh__Sing_Dil_Se__Aashiqui_2__Arijit_Singh(256k).mp3
My_top_25_pandas_tricks(720p).mp4.smi
o_pata_nahi_ji_konsa_nasha_karta_hai_-_Titliyan_full_Song_Hardy_Sandhu__Yaar_Mera_Titliyan_Warga(256k).mp3
Passive_voice_of_LET__Active_and_Passive_Voice_in_English_Grammar(480p).mp4
Salam-E-Ishq_Meri_Jaan_Zara_Kabul_Kar_Lo__Muqaddar_Ka_Sikandar (1978)__Amitabh_Bachchan,_Rekha(1080p).mp4
SEARCHING_&_SORTING_COMPLETE_(_In_just_50_min)(360p).mp4
Second_Normal_Form_in_DBMS__2NF_in_dbms__Normalization_in_DBMS(360p).mp4
Second_Normal_Form_in_DBMS__2NF_in_dbms__Normalization_in_DBMS(360p).mp4.smi
Tu_Chahida_Song,_Ve_Mainu_Juttiyan_Di_Lod_Nahi_Tu_Chahida,_Ve_Mainu_Tu_Chahida_Riyaz_Aly,_Aroob_Khan(720p).mp4
Understand_FAST_English_Conversations(480p).mp4
Understand_FAST_English_Conversations(480p).mp4.smi
vm3u8cache
WRITING_SKILL,Essay_Writing_(The_Most_important)कैसे_सोचे_कैसे_लिखे_🔥🔥(480p).mp4
Yaaro_Tod_Deni_Surjit_Bhullar__यारी_तोड़_दनेी__Surjit_Bhullar__Panjabi_Song__2020(256k).mp3
_Fazilpuria_feat_Deepti__Afsana__Jaani__SukhE__New_Haryanvi_Songs_Haryanavi_2020(256k).mp3
_First_Normal_form_in_DBMS_in_HINDI__1st_Normal_form_कय्ा_होती_ह_ै(360p).mp4
_Jass_Manak_(Full_Video)_Satti_Dhillon__Sharry_Nexus__GK_DIGITAL__New_Songs__Geet_MP3(256k).mp3
_Neha_Kakkar,_Sunny_Kaushal__Jubin_Nautiyal,Jaani__Bhushan_Kumar__Arvindr_K(256k).mp3
_Third_Normal_Form_in_dbms_with_examples_in_Hindi__Normalization(360p).mp4
_Tum_Hi_Aana__Marjaavaan__Riteish_D,_Sidharth_M,_Tara_S_Jubin_Nautiyal,Payal_Dev,Kunaal_V(256k).mp3
मैया_तेरे_चरणों_की_Ambe_Tere_Charno_Ki__बहुत_ही_मधुर_नये_म्यूजिक_के_साथ___Saijal__Isha__Anchal(256k).mp3

In [28]:
if os.path.exists("ranjitfile.txt"):
    print("present")
else:
    print("not present")

not present

In [9]:
import pandas as pd
import numpy as np

In [98]:
dataa=np.arange(1,501).reshape(50,10)
dataa[0:5]

array([[ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
       [31, 32, 33, 34, 35, 36, 37, 38, 39, 40],
       [41, 42, 43, 44, 45, 46, 47, 48, 49, 50]])

In [93]:
dataa[3:5,2:3]

array([[33],
       [43]])

In [100]:
df=pd.DataFrame(data=dataa,columns=["col_"+str(i) for i in range(1,11)],index=["row_"+str(i) for i in range(1,51)])

In [101]:
df.head()

       col_1  col_2  col_3  col_4  col_5  col_6  col_7  col_8  col_9  col_10
row_1      1      2      3      4      5      6      7      8      9      10
row_2     11     12     13     14     15     16     17     18     19      20
row_3     21     22     23     24     25     26     27     28     29      30
row_4     31     32     33     34     35     36     37     38     39      40
row_5     41     42     43     44     45     46     47     48     49      50

In [15]:
df.index

Index(['row_1', 'row_2', 'row_3', 'row_4', 'row_5', 'row_6', 'row_7', 'row_8',
       'row_9', 'row_10', 'row_11', 'row_12', 'row_13', 'row_14', 'row_15',
       'row_16', 'row_17', 'row_18', 'row_19', 'row_20', 'row_21', 'row_22',
       'row_23', 'row_24', 'row_25', 'row_26', 'row_27', 'row_28', 'row_29',
       'row_30', 'row_31', 'row_32', 'row_33', 'row_34', 'row_35', 'row_36',
       'row_37', 'row_38', 'row_39', 'row_40', 'row_41', 'row_42', 'row_43',
       'row_44', 'row_45', 'row_46', 'row_47', 'row_48', 'row_49', 'row_50'],
      dtype='object')

In [18]:
df.index

Index(['row_1', 'row_2', 'row_3', 'row_4', 'row_5', 'row_6', 'row_7', 'row_8',
       'row_9', 'row_10', 'row_11', 'row_12', 'row_13', 'row_14', 'row_15',
       'row_16', 'row_17', 'row_18', 'row_19', 'row_20', 'row_21', 'row_22',
       'row_23', 'row_24', 'row_25', 'row_26', 'row_27', 'row_28', 'row_29',
       'row_30', 'row_31', 'row_32', 'row_33', 'row_34', 'row_35', 'row_36',
       'row_37', 'row_38', 'row_39', 'row_40', 'row_41', 'row_42', 'row_43',
       'row_44', 'row_45', 'row_46', 'row_47', 'row_48', 'row_49', 'row_50'],
      dtype='object')

In [20]:
df.dtypes

col_1     int32
col_2     int32
col_3     int32
col_4     int32
col_5     int32
col_6     int32
col_7     int32
col_8     int32
col_9     int32
col_10    int32
dtype: object

In [21]:
df.col_2

row_1       2
row_2      12
row_3      22
row_4      32
row_5      42
row_6      52
row_7      62
row_8      72
row_9      82
row_10     92
row_11    102
row_12    112
row_13    122
row_14    132
row_15    142
row_16    152
row_17    162
row_18    172
row_19    182
row_20    192
row_21    202
row_22    212
row_23    222
row_24    232
row_25    242
row_26    252
row_27    262
row_28    272
row_29    282
row_30    292
row_31    302
row_32    312
row_33    322
row_34    332
row_35    342
row_36    352
row_37    362
row_38    372
row_39    382
row_40    392
row_41    402
row_42    412
row_43    422
row_44    432
row_45    442
row_46    452
row_47    462
row_48    472
row_49    482
row_50    492
Name: col_2, dtype: int32

In [22]:
df['col_2']

row_1       2
row_2      12
row_3      22
row_4      32
row_5      42
row_6      52
row_7      62
row_8      72
row_9      82
row_10     92
row_11    102
row_12    112
row_13    122
row_14    132
row_15    142
row_16    152
row_17    162
row_18    172
row_19    182
row_20    192
row_21    202
row_22    212
row_23    222
row_24    232
row_25    242
row_26    252
row_27    262
row_28    272
row_29    282
row_30    292
row_31    302
row_32    312
row_33    322
row_34    332
row_35    342
row_36    352
row_37    362
row_38    372
row_39    382
row_40    392
row_41    402
row_42    412
row_43    422
row_44    432
row_45    442
row_46    452
row_47    462
row_48    472
row_49    482
row_50    492
Name: col_2, dtype: int32

In [23]:
df[['col_2']]

        col_2
row_1       2
row_2      12
row_3      22
row_4      32
row_5      42
row_6      52
row_7      62
row_8      72
row_9      82
row_10     92
row_11    102
row_12    112
row_13    122
row_14    132
row_15    142
row_16    152
row_17    162
row_18    172
row_19    182
row_20    192
row_21    202
row_22    212
row_23    222
row_24    232
row_25    242
row_26    252
row_27    262
row_28    272
row_29    282
row_30    292
row_31    302
row_32    312
row_33    322
row_34    332
row_35    342
row_36    352
row_37    362
row_38    372
row_39    382
row_40    392
row_41    402
row_42    412
row_43    422
row_44    432
row_45    442
row_46    452
row_47    462
row_48    472
row_49    482
row_50    492

In [25]:
df[['col_2','col_3']]

        col_2  col_3
row_1       2      3
row_2      12     13
row_3      22     23
row_4      32     33
row_5      42     43
row_6      52     53
row_7      62     63
row_8      72     73
row_9      82     83
row_10     92     93
row_11    102    103
row_12    112    113
row_13    122    123
row_14    132    133
row_15    142    143
row_16    152    153
row_17    162    163
row_18    172    173
row_19    182    183
row_20    192    193
row_21    202    203
row_22    212    213
row_23    222    223
row_24    232    233
row_25    242    243
row_26    252    253
row_27    262    263
row_28    272    273
row_29    282    283
row_30    292    293
row_31    302    303
row_32    312    313
row_33    322    323
row_34    332    333
row_35    342    343
row_36    352    353
row_37    362    363
row_38    372    373
row_39    382    383
row_40    392    393
row_41    402    403
row_42    412    413
row_43    422    423
row_44    432    433
row_45    442    443
row_46    452    453
row_47    462    463
row_48    472    473
row_49    482    483
row_50    492    493

In [26]:
df[['col_2','col_3']].sum()

col_2    12350
col_3    12400
dtype: int64

In [27]:
df.col_1.sum()        #this is bad habbit

12300

In [28]:
df.head()

       col_1  col_2  col_3  col_4  col_5  col_6  col_7  col_8  col_9  col_10
row_1      1      2      3      4      5      6      7      8      9      10
row_2     11     12     13     14     15     16     17     18     19      20
row_3     21     22     23     24     25     26     27     28     29      30
row_4     31     32     33     34     35     36     37     38     39      40
row_5     41     42     43     44     45     46     47     48     49      50

In [30]:
df.head(1)

       col_1  col_2  col_3  col_4  col_5  col_6  col_7  col_8  col_9  col_10
row_1      1      2      3      4      5      6      7      8      9      10

In [31]:
df.head(2)

       col_1  col_2  col_3  col_4  col_5  col_6  col_7  col_8  col_9  col_10
row_1      1      2      3      4      5      6      7      8      9      10
row_2     11     12     13     14     15     16     17     18     19      20

In [36]:
df.describe()     #details provide

,col_1,col_2,col_3,col_4,col_5,col_6,col_7,col_8,col_9,col_10
count,50.000000,50.000000,50.000000,50.000000,50.000000,50.000000,50.000000,50.000000,50.000000,50.000000
mean,246.000000,247.000000,248.000000,249.000000,250.000000,251.000000,252.000000,253.000000,254.000000,255.000000
std,145.773797,145.773797,145.773797,145.773797,145.773797,145.773797,145.773797,145.773797,145.773797,145.773797
min,1.000000,2.000000,3.000000,4.000000,5.000000,6.000000,7.000000,8.000000,9.000000,10.000000
25%,123.500000,124.500000,125.500000,126.500000,127.500000,128.500000,129.500000,130.500000,131.500000,132.500000
50%,246.000000,247.000000,248.000000,249.000000,250.000000,251.000000,252.000000,253.000000,254.000000,255.000000
75%,368.500000,369.500000,370.500000,371.500000,372.500000,373.500000,374.500000,375.500000,376.500000,377.500000
max,491.000000,492.000000,493.000000,494.000000,495.000000,496.000000,497.000000,498.000000,499.000000,500.000000

In [40]:
df.mean()       #for average

col_1     246.0
col_2     247.0
col_3     248.0
col_4     249.0
col_5     250.0
col_6     251.0
col_7     252.0
col_8     253.0
col_9     254.0
col_10    255.0
dtype: float64

In [42]:
df.std()           #standard value

col_1     145.773797
col_2     145.773797
col_3     145.773797
col_4     145.773797
col_5     145.773797
col_6     145.773797
col_7     145.773797
col_8     145.773797
col_9     145.773797
col_10    145.773797
dtype: float64

In [44]:
df.min()

col_1      1
col_2      2
col_3      3
col_4      4
col_5      5
col_6      6
col_7      7
col_8      8
col_9      9
col_10    10
dtype: int32

In [45]:
df.max()

col_1     491
col_2     492
col_3     493
col_4     494
col_5     495
col_6     496
col_7     497
col_8     498
col_9     499
col_10    500
dtype: int32

In [47]:
df.col_2.max()           #first way

492

In [48]:
df["col_2"].max()           #second way fatch elment

492

In [53]:
df[["col_1","col_2"]].max()

col_1    491
col_2    492
dtype: int32

In [55]:
df.shape       #for chek the shape of datafrmae

(50, 10)

In [56]:
df.ndim             # chek the dimension in dataframe

2

In [54]:
df[1:2]

       col_1  col_2  col_3  col_4  col_5  col_6  col_7  col_8  col_9  col_10
row_2     11     12     13     14     15     16     17     18     19      20

In [59]:
df[2:5]

       col_1  col_2  col_3  col_4  col_5  col_6  col_7  col_8  col_9  col_10
row_3     21     22     23     24     25     26     27     28     29      30
row_4     31     32     33     34     35     36     37     38     39      40
row_5     41     42     43     44     45     46     47     48     49      50

In [61]:
df.columns

Index(['col_1', 'col_2', 'col_3', 'col_4', 'col_5', 'col_6', 'col_7', 'col_8',
       'col_9', 'col_10'],
      dtype='object')

In [62]:
df.index

Index(['row_1', 'row_2', 'row_3', 'row_4', 'row_5', 'row_6', 'row_7', 'row_8',
       'row_9', 'row_10', 'row_11', 'row_12', 'row_13', 'row_14', 'row_15',
       'row_16', 'row_17', 'row_18', 'row_19', 'row_20', 'row_21', 'row_22',
       'row_23', 'row_24', 'row_25', 'row_26', 'row_27', 'row_28', 'row_29',
       'row_30', 'row_31', 'row_32', 'row_33', 'row_34', 'row_35', 'row_36',
       'row_37', 'row_38', 'row_39', 'row_40', 'row_41', 'row_42', 'row_43',
       'row_44', 'row_45', 'row_46', 'row_47', 'row_48', 'row_49', 'row_50'],
      dtype='object')

In [3]:
data=pd.read_csv('pollice data.csv')

In [4]:
data.head(3)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,1/2/2005,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,1/18/2005,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
2,1/23/2005,23:15,NaN,M,1972.0,33.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

In [5]:
data.describe()

       country_name  driver_age_raw    driver_age
count           0.0    61481.000000  61228.000000
mean            NaN     1967.791106     34.148984
std             NaN      121.050106     12.760710
min             NaN        0.000000     15.000000
25%             NaN     1965.000000     23.000000
50%             NaN     1978.000000     31.000000
75%             NaN     1985.000000     43.000000
max             NaN     8801.000000     88.000000

In [33]:
np.unique(data['driver_age'])

array([15., 16., 17., ..., nan, nan, nan])

In [11]:
data.columns

Index(['stop_date', 'stop_time', 'country_name', 'driver_gender',
       'driver_age_raw', 'driver_age', 'driver_race', 'violation_raw',
       'violation', 'search_conducted', 'search_type', 'stop_outcome',
       'is_arrested', 'stop_duration', 'drugs_related_stop'],
      dtype='object')

In [30]:
#  >>>>>>>>>> here i am using exception handling concept<<<<<<<<<<<<<<<<<<<<<<<
for col in data.columns:
    try:
        print(col,">>>>>>",len(np.unique(data[col])),'>>>>>',data[col].dtypes)
    except: 
        print('here no other catogorical column')
        print()
        break
    else:
        print('this is else part in excehandling')
        print()
    finally:
        print("this is finally part ")

stop_date >>>>>> 2651 >>>>> object
this is else part in excehandling

this is finally part
stop_time >>>>>> 1432 >>>>> object
this is else part in excehandling

this is finally part
country_name >>>>>> 65535 >>>>> float64
this is else part in excehandling

this is finally part
here no other catogorical column

this is finally part

In [19]:
pd.value_counts(data['stop_time'])

10:00    280
11:00    280
9:00     252
10:30    251
9:30     246
        ...
4:14       1
4:50       1
5:38       1
4:32       1
5:23       1
Name: stop_time, Length: 1432, dtype: int64

In [9]:
data=pd.read_csv('data.csv')
data

        N   P   K  temperature   humidity        ph    rainfall   label
0      90  42  43    20.879744  82.002744  6.502985  202.935536    rice
1      85  58  41    21.770462  80.319644  7.038096  226.655537    rice
2      60  55  44    23.004459  82.320763  7.840207  263.964248    rice
3      74  35  40    26.491096  80.158363  6.980401  242.864034    rice
4      78  42  42    20.130175  81.604873  7.628473  262.717340    rice
...   ...  ..  ..          ...        ...       ...         ...     ...
2195  107  34  32    26.774637  66.413269  6.780064  177.774507  coffee
2196   99  15  27    27.417112  56.636362  6.086922  127.924610  coffee
2197  118  33  30    24.131797  67.225123  6.362608  173.322839  coffee
2198  117  32  34    26.272418  52.127394  6.758793  127.175293  coffee
2199  104  18  30    23.603016  60.396475  6.779833  140.937041  coffee

[2200 rows x 8 columns]

In [21]:
# data.to_excel('data.xlsx',engine='xlsxwriter')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2200 entries, 0 to 2199
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   N            2200 non-null   int64
 1   P            2200 non-null   int64
 2   K            2200 non-null   int64
 3   temperature  2200 non-null   float64
 4   humidity     2200 non-null   float64
 5   ph           2200 non-null   float64
 6   rainfall     2200 non-null   float64
 7   label        2200 non-null   object
dtypes: float64(4), int64(3), object(1)
memory usage: 137.6+ KB

In [23]:
data.to_excel('data.xlsx',sheet_name='passenger',index=False)
# this method is write but i don,t know how does not work

ModuleNotFoundError: No module named 'openpyxl'

In [26]:
data.label.value_counts()

coconut        100
kidneybeans    100
cotton         100
grapes         100
orange         100
coffee         100
pomegranate    100
papaya         100
blackgram      100
mungbean       100
rice           100
lentil         100
watermelon     100
mango          100
pigeonpeas     100
banana         100
apple          100
muskmelon      100
chickpea       100
mothbeans      100
jute           100
maize          100
Name: label, dtype: int64

## we want fatch those records that contains rice in label coulumn by using isin()

In [32]:
rice=data[data['label'].isin(['rice'])]
rice

     N   P   K  temperature   humidity        ph    rainfall label
0   90  42  43    20.879744  82.002744  6.502985  202.935536  rice
1   85  58  41    21.770462  80.319644  7.038096  226.655537  rice
2   60  55  44    23.004459  82.320763  7.840207  263.964248  rice
3   74  35  40    26.491096  80.158363  6.980401  242.864034  rice
4   78  42  42    20.130175  81.604873  7.628473  262.717340  rice
..  ..  ..  ..          ...        ...       ...         ...   ...
95  88  46  42    22.683191  83.463583  6.604993  194.265172  rice
96  93  47  37    21.533463  82.140041  6.500343  295.924880  rice
97  60  55  45    21.408658  83.329319  5.935745  287.576694  rice
98  78  35  44    26.543481  84.673536  7.072656  183.622266  rice
99  65  37  40    23.359054  83.595123  5.333323  188.413665  rice

[100 rows x 8 columns]

In [33]:
rice.shape

(100, 8)

## and now banana and papaya record fatch

In [35]:
banana_papaya=data[data['label'].isin(['banana','papaya'])]
banana_papaya.shape

(200, 8)

In [37]:
same_data_fatch=data[(data.label=='banana')|(data.label=='papaya')]
same_data_fatch.shape

(200, 8)

In [5]:
a=npr.seed(0)
# i don,t know wht does work this function

## and i will find the mising value percetage in the dataset

## missing value strategies

In [1]:
import pandas as pd
import numpy as np

In [3]:
dataa=pd.read_csv('titanic.csv')
dataa.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## find out percentage value of missing value

In [17]:
missing_value_count=dataa.isnull().sum()
missing_value_count

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [21]:
total_null=missing_value_count.sum()
total_null
#this is total number of mising value

866

## find out tatal cells in  my dataset

In [19]:
dataa.shape

(891, 12)

In [9]:
dataa.size

10692

In [8]:
891*12

10692

In [20]:
total_cells=np.product(dataa.shape)
total_cells

10692

## find out percentag3 with the help of total mising value and total cells

In [22]:
percentage_mising_value=(total_null/total_cells)*100
percentage_mising_value
#you can see now 8% mising value in my data

8.099513655069211

In [17]:
total_cells=np.product(dataa.shape)
total_mising_value=missing_value_count.sum()
percentage_mising_vlue=(total_mising_value/total_cells)*100
print(f"this is your missing value percantage:- {percentage_mising_vlue} ")

this is your missing value percantage:- 16.822868187482516

### how many mising value in first ten column

In [27]:
missing_value_count[0:10]

stop_date               0
stop_time               0
country_name        65535
driver_gender        4061
driver_age_raw       4054
driver_age           4307
driver_race          4060
violation_raw        4060
violation            4060
search_conducted        0
dtype: int64

In [28]:
missing_value_count.head(10)

stop_date               0
stop_time               0
country_name        65535
driver_gender        4061
driver_age_raw       4054
driver_age           4307
driver_race          4060
violation_raw        4060
violation            4060
search_conducted        0
dtype: int64

In [25]:
len(dataa.columns)

15

In [26]:
dataa.columns.shape

(15,)

## remove all mising value

In [24]:
dataa.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [26]:
dataa.shape

(891, 12)

## here i am drop those column which are containing at least one mising vlaue

In [31]:
null_free=dataa.dropna()
null_free.isnull().sum()
# here all rows has been deleted that contains at least one single null value

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [33]:
null_free.shape

(183, 12)

In [35]:
null_free.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

## and now we will remove all that columns are containing null values

In [32]:
dataa.shape

(891, 12)

In [40]:
drop_null_column=dataa.dropna(axis='columns')    #here axis 1 is columnns and 0 is row
drop_null_column.shape

(891, 9)

In [41]:
drop_null_column=dataa.dropna(axis=1)    #here axis 1 is columnns and 0 is row
drop_null_column.shape

(891, 9)

In [43]:
dropnull=dataa.dropna(axis=0)
dropnull.shape

(183, 12)

In [45]:
dropnulle=dataa.dropna(axis='rows')
dropnulle.shape

(183, 12)

In [55]:
full_columns=data.shape[1]
full_columns

15

In [61]:
remander_columns =data.dropna(axis=1)
# remander_columns =data.dropna(['price'],axis=1) another use type
#here i am drop those columns which are contains at least one mising value
remain_col=remander_columns.shape[1]
remain_col

4

In [35]:
data.isnull().sum()

stop_date                 0
stop_time                 0
country_name          65535
driver_gender          4061
driver_age_raw         4054
driver_age             4307
driver_race            4060
violation_raw          4060
violation              4060
search_conducted          0
search_type           63056
stop_outcome           4060
is_arrested            4060
stop_duration          4060
drugs_related_stop        0
dtype: int64

In [49]:
after_removing_col=data.shape[1]
after_removing_col

(65535, 15)

In [63]:
print(f" this is first columnsize when i was not drop the column :- {full_columns}")
print(f" this is columnsize when i was  drop the column :- {remain_col}")

 this is first columnsize when i was not drop the column :- 15
 this is columnsize when i was  drop the column :- 4

## filling mising value

In [52]:
null_column=dataa.loc[:,['Cabin']]
null_column.head()

  Cabin
0   NaN
1   C85
2   NaN
3  C123
4   NaN

In [68]:
subset=data.loc[:,['country_name','search_type']]
                  
subset.head()

   country_name search_type
0           NaN         NaN
1           NaN         NaN
2           NaN         NaN
3           NaN         NaN
4           NaN         NaN

In [69]:
subset.fillna(0)

       country_name search_type
0               0.0           0
1               0.0           0
2               0.0           0
3               0.0           0
4               0.0           0
...             ...         ...
65530           0.0           0
65531           0.0           0
65532           0.0           0
65533           0.0           0
65534           0.0           0

[65535 rows x 2 columns]

In [70]:
subset

       country_name search_type
0               NaN         NaN
1               NaN         NaN
2               NaN         NaN
3               NaN         NaN
4               NaN         NaN
...             ...         ...
65530           NaN         NaN
65531           NaN         NaN
65532           NaN         NaN
65533           NaN         NaN
65534           NaN         NaN

[65535 rows x 2 columns]

In [72]:
subset["search_type"].value_counts()

Incident to Arrest                                          1074
Probable Cause                                               579
Inventory                                                    173
Reasonable Suspicion                                         149
Protective Frisk                                             126
Incident to Arrest,Inventory                                 104
Incident to Arrest,Probable Cause                             79
Probable Cause,Reasonable Suspicion                           38
Incident to Arrest,Protective Frisk                           31
Incident to Arrest,Inventory,Probable Cause                   26
Probable Cause,Protective Frisk                               23
Inventory,Probable Cause                                      14
Incident to Arrest,Inventory,Protective Frisk                 11
Inventory,Protective Frisk                                    11
Protective Frisk,Reasonable Suspicion                         10
Incident to Arrest,Probable Cause,Protective Frisk            10
Incident to Arrest,Reasonable Suspicion                        8
Inventory,Reasonable Suspicion                                 4
Incident to Arrest,Probable Cause,Reasonable Suspicion         3
Incident to Arrest,Inventory,Reasonable Suspicion              2
Inventory,Probable Cause,Protective Frisk                      2
Incident to Arrest,Protective Frisk,Reasonable Suspicion       1
Inventory,Probable Cause,Reasonable Suspicion                  1
Name: search_type, dtype: int64

In [73]:
subset.fillna(method='bfill', axis=0).fillna(0)
# this method is used for backwordfill if NAN value is exist 
# and remember that two time using fillna function

       country_name                          search_type
0               0.0  Incident to Arrest,Protective Frisk
1               0.0  Incident to Arrest,Protective Frisk
2               0.0  Incident to Arrest,Protective Frisk
3               0.0  Incident to Arrest,Protective Frisk
4               0.0  Incident to Arrest,Protective Frisk
...             ...                                  ...
65530           0.0                                    0
65531           0.0                                    0
65532           0.0                                    0
65533           0.0                                    0
65534           0.0                                    0

[65535 rows x 2 columns]

In [57]:
dataa.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## list comrehension in this list we will append all thats columns are containing missing value

In [58]:
null_columns=[col for col in dataa.columns if dataa[col].isnull().any()]
null_columns

['Age', 'Cabin', 'Embarked']

## and we will remove all that columns contain mising value

In [60]:
data=dataa.drop(columns=null_columns)
data.head()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500

In [ ]:
cols_with_missing = [col for col in X_train.columns
                     if X_train[col].isnull().any()]
# superb tricks
2:- # Drop columns in training and validation data
reduced_X_train = X_train.drop(cols_with_missing, axis=1)
reduced_X_valid = X_valid.drop(cols_with_missing, axis=1)

In [18]:
dataset.columns.str.upper()   #for change the capital letter

Index(['STOP_DATE', 'STOP_TIME', 'COUNTRY_NAME', 'DRIVER_GENDER',
       'DRIVER_AGE_RAW', 'DRIVER_AGE', 'DRIVER_RACE', 'VIOLATION_RAW',
       'VIOLATION', 'SEARCH_CONDUCTED', 'SEARCH_TYPE', 'STOP_OUTCOME',
       'IS_ARRESTED', 'STOP_DURATION', 'DRUGS_RELATED_STOP'],
      dtype='object')

In [22]:
dataset.filter(items=['stop_date','is_arrested']).head(2)
#filter function using for fatch data with filter functionalty

   stop_date is_arrested
0   1/2/2005       False
1  1/18/2005       False

In [9]:
dataset.head(2)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,1/2/2005,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,1/18/2005,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

## SORT_INDEX function u can use columns or rows instead of axis=0 or 1

In [72]:
dataa.sort_index(axis=1).head()   #axis 1 is row it means there will be sorted columns name

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0,373450

In [75]:
dataa.sort_index(axis=0,ascending=False).head()       #axis 0 index number

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S

In [76]:
dataa.sort_index(ascending=False).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S

In [16]:
#it is used for index sorting and this convert the ascending order into descending order
# and here axis 0--> column and 1-->row its true 
# column name are present in the row
# and index value present inthe column
# so here axis is interesting
# ascending true by default
dataset.sort_index(axis=0,ascending=False)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
65534,12/7/2012,0:30,NaN,F,1985.0,27.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
65533,12/7/2012,0:23,NaN,NaN,NaN,NaN,NaN,NaN,NaN,False,NaN,NaN,NaN,NaN,False
65532,12/6/2012,23:20,NaN,M,1985.0,27.0,Black,Equipment/Inspection Violation,Equipment,False,NaN,Citation,False,0-15 Min,False
65531,12/6/2012,22:22,NaN,M,1954.0,58.0,White,Speeding,Speeding,False,NaN,Warning,False,0-15 Min,False
65530,12/6/2012,17:54,NaN,F,1987.0,25.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,3/14/2005,10:00,NaN,F,1984.0,21.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
3,2/20/2005,17:15,NaN,M,1986.0,19.0,White,Call for Service,Other,False,NaN,Arrest Driver,True,16-30 Min,False
2,1/23/2005,23:15,NaN,M,1972.0,33.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,1/18/2005,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
0,1/2/2005,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

In [79]:
dataa.sort_index(axis='columns',ascending=True)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0,373450
...,...,...,...,...,...,...,...,...,...,...,...,...
886,27.0,NaN,S,13.0000,"Montvila, Rev. Juozas",0,887,2,male,0,0,211536
887,19.0,B42,S,30.0000,"Graham, Miss. Margaret Edith",0,888,1,female,0,1,112053
888,NaN,NaN,S,23.4500,"Johnston, Miss. Catherine Helen ""Carrie""",2,889,3,female,1,0,W./C. 6607
889,26.0,C148,C,30.0000,"Behr, Mr. Karl Howell",0,890,1,male,0,1,111369
890,32.0,NaN,Q,7.7500,"Dooley, Mr. Patrick",0,891,3,male,0,0,370376

In [18]:
dataset.sort_index(axis=0).head(2)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,1/2/2005,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,1/18/2005,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

In [21]:
dataset.sort_index(axis=1).head(3)
# here columns name are presenting like a string
# and column names are sorting  string wise

,country_name,driver_age,driver_age_raw,driver_gender,driver_race,drugs_related_stop,is_arrested,search_conducted,search_type,stop_date,stop_duration,stop_outcome,stop_time,violation,violation_raw
0,NaN,20.0,1985.0,M,White,False,False,False,NaN,1/2/2005,0-15 Min,Citation,1:55,Speeding,Speeding
1,NaN,40.0,1965.0,M,White,False,False,False,NaN,1/18/2005,0-15 Min,Citation,8:15,Speeding,Speeding
2,NaN,33.0,1972.0,M,White,False,False,False,NaN,1/23/2005,0-15 Min,Citation,23:15,Speeding,Speeding

In [25]:
dataset.sort_index(axis=1,ascending=False).head(1)
# column name are sorting in descending order

,violation_raw,violation,stop_time,stop_outcome,stop_duration,stop_date,search_type,search_conducted,is_arrested,drugs_related_stop,driver_race,driver_gender,driver_age_raw,driver_age,country_name
0,Speeding,Speeding,1:55,Citation,0-15 Min,1/2/2005,NaN,False,False,False,White,M,1985.0,20.0,NaN

## there is no difference inthe database bcz i did not use inplace keyword

In [27]:
dataset.head(3)

,stop_date,stop_time,country_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,1/2/2005,1:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,1/18/2005,8:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
2,1/23/2005,23:15,NaN,M,1972.0,33.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

In [32]:
dataset.sort_index(axis=1,inplace=True)
dataset.head(3)
#and now dataset changed by using inplace parametere

,country_name,driver_age,driver_age_raw,driver_gender,driver_race,drugs_related_stop,is_arrested,search_conducted,search_type,stop_date,stop_duration,stop_outcome,stop_time,violation,violation_raw
0,NaN,20.0,1985.0,M,White,False,False,False,NaN,1/2/2005,0-15 Min,Citation,1:55,Speeding,Speeding
1,NaN,40.0,1965.0,M,White,False,False,False,NaN,1/18/2005,0-15 Min,Citation,8:15,Speeding,Speeding
2,NaN,33.0,1972.0,M,White,False,False,False,NaN,1/23/2005,0-15 Min,Citation,23:15,Speeding,Speeding

In [36]:
dataset.reset_index()

,index,country_name,driver_age,driver_age_raw,driver_gender,driver_race,drugs_related_stop,is_arrested,search_conducted,search_type,stop_date,stop_duration,stop_outcome,stop_time,violation,violation_raw
0,0,NaN,20.0,1985.0,M,White,False,False,False,NaN,1/2/2005,0-15 Min,Citation,1:55,Speeding,Speeding
1,1,NaN,40.0,1965.0,M,White,False,False,False,NaN,1/18/2005,0-15 Min,Citation,8:15,Speeding,Speeding
2,2,NaN,33.0,1972.0,M,White,False,False,False,NaN,1/23/2005,0-15 Min,Citation,23:15,Speeding,Speeding
3,3,NaN,19.0,1986.0,M,White,False,True,False,NaN,2/20/2005,16-30 Min,Arrest Driver,17:15,Other,Call for Service
4,4,NaN,21.0,1984.0,F,White,False,False,False,NaN,3/14/2005,0-15 Min,Citation,10:00,Speeding,Speeding
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
65530,65530,NaN,25.0,1987.0,F,White,False,False,False,NaN,12/6/2012,0-15 Min,Citation,17:54,Speeding,Speeding
65531,65531,NaN,58.0,1954.0,M,White,False,False,False,NaN,12/6/2012,0-15 Min,Warning,22:22,Speeding,Speeding
65532,65532,NaN,27.0,1985.0,M,Black,False,False,False,NaN,12/6/2012,0-15 Min,Citation,23:20,Equipment,Equipment/Inspection Violation
65533,65533,NaN,NaN,NaN,NaN,NaN,False,NaN,False,NaN,12/7/2012,NaN,NaN,0:23,NaN,NaN
65534,65534,NaN,27.0,1985.0,F,White,False,False,False,NaN,12/7/2012,0-15 Min,Citation,0:30,Speeding,Speeding

In [4]:
import numpy
import pandas
import seaborn
import matplotlib.pyplot as plt
import scipy
import datetime
import numpy.random as npr

## fromfunction return a  ndarray (10,4) shape

In [4]:
func=np.fromfunction(lambda i, j: i + j, (10, 4), dtype=int~)
print(func)

[[ 0  1  2  3]
 [ 1  2  3  4]
 [ 2  3  4  5]
 [ 3  4  5  6]
 [ 4  5  6  7]
 [ 5  6  7  8]
 [ 6  7  8  9]
 [ 7  8  9 10]
 [ 8  9 10 11]
 [ 9 10 11 12]]

In [83]:
fucn=np.fromfunction(lambda i,j:i+j,(10,5),dtype=int)
fucn
#it will return just a ndarray 10,5 shape random array

array([[ 0,  1,  2,  3,  4],
       [ 1,  2,  3,  4,  5],
       [ 2,  3,  4,  5,  6],
       [ 3,  4,  5,  6,  7],
       [ 4,  5,  6,  7,  8],
       [ 5,  6,  7,  8,  9],
       [ 6,  7,  8,  9, 10],
       [ 7,  8,  9, 10, 11],
       [ 8,  9, 10, 11, 12],
       [ 9, 10, 11, 12, 13]])

In [84]:
data=pd.read_csv("titanic.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [94]:
data[data['Name'].str.contains('Braund')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
477,478,0,3,"Braund, Mr. Lewis Richard",male,29.0,1,0,3460,7.0458,NaN,S

In [100]:
filt=data['Name'].str.contains('Braund')
data.loc[filt,'Name']
# you can see now there are only two name similar to my variable

0        Braund, Mr. Owen Harris
477    Braund, Mr. Lewis Richard
Name: Name, dtype: object